#include <stdio.h>
#include "ui.h"

void menu(void)
{
    printf("Меню управления:\n");
    printf("0 - Выйти из программы\n");
    printf("1 - Прочитать файл\n");
    printf("2 - Вывести данные\n");
    printf("3 - Вывести таблицу ключей\n");
    printf("4 - Добавить запись\n");
    printf("5 - Удалить запись\n");
    printf("6 - Отсортировать по кол. страниц (быстрая сортировка)\n");
    printf("7 - Отсортировать по кол. страниц (медленная сортировка)\n");
    printf("8 - Отсортировать таблицу ключей (быстрая сортировка)\n");
    printf("9 - Отсортировать таблицу ключей (медленная сортировка)\n");
    printf("10 - Вывести данные по таблице ключей\n");
    printf("11 - Вывести таблицу эффективности\n");
    printf("12 - Вывести список всех романов указанного автора\n");
    printf("\n");
}
