#include <stdio.h>
#include "ui.h"

void menu(void)
{
    printf("Меню управления:\n");
    printf("0   - Выйти из программы\n");
    printf("------------------------\n");
    printf("1   - Считать дерево из файла чисел\n");
    printf("2   - Вывести дерево в виде графа\n");
    printf("3   - Проверить наличие числа в дереве\n");
    printf("4   - Добавить число в дерево\n");
    printf("5   - Удалить число из дерева\n");
    printf("------------------------\n");
    printf("6   - Считать сбалансированное дерево из файла чисел\n");
    printf("7   - Вывести сбалансированное дерево в виде графа\n");
    printf("8   - Проверить наличие числа в сбалансированном дереве\n");
    printf("9   - Добавить число в сбалансированное дерево\n");
    printf("10  - Удалить число из сбалансированного дерева\n");
    printf("------------------------\n");
    printf("11  - Считать хеш-таблицу из файла чисел\n");
    printf("12  - Вывести хеш-таблицу\n");
    printf("13  - Проверить наличие числа в хеш-таблице\n");
    printf("14  - Добавить число в хеш-таблицу\n");
    printf("15  - Удалить число из хеш-таблицы\n");
    printf("------------------------\n");
    printf("16  - Сравнить эффективность поиска в различных структурах\n");
    printf("\n");
}
