#include <stdio.h>
#include "ui.h"

void menu(void)
{
    printf("Меню управления:\n");
    printf("0 - Выйти из программы\n");
    printf("1 - Инициализировать две матрицы\n");
    printf("2 - Вывести первую матрицу\n");
    printf("3 - Вывести характеристику первой разреженной матрицы\n");
    printf("4 - Вывести первую разреженную матрицу\n");
    printf("5 - Вывести вторую матрицу\n");
    printf("6 - Вывести характеристику второй разреженной матрицы\n");
    printf("7 - Вывести вторую разреженную матрицу\n");
    printf("8 - Посчитать сложение первых двух обычных матриц и вывести результат\n");
    printf("9 - Посчитать сложение первых двух разреженных матриц и вывести результат\n");
    printf("10 - Сравнить время выполнения суммы для разреженной и стандартной матриц\n");

    printf("\n");    
}
